app/controllers/accounts_controller.rb

SELECT `subscription_plans`.* FROM `subscription_plans` WHERE (id <> 276395349) ORDER BY amount desc
---
  def plan
    if request.post?
      @subscription.plan = SubscriptionPlan.find(params[:plan_id])

SELECT `subscription_discounts`.* FROM `subscription_discounts` WHERE `subscription_discounts`.`code` = 'bar' LIMIT 1
---
    def load_discount
      if params[:discount].blank? || !(@discount = SubscriptionDiscount.find_by_code(params[:discount])) || !@discount.available?