app/controllers/apps_controller.rb

  def development_push_certificates
    application = App.find(params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1

  def production_push_certificates
    application = App.find(params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1

  def index
    @applications = App.paginate(:per_page => 5, :page => params[:page]).find_all_by_account_id(current_account.id)
---
SELECT COUNT(*) FROM `apps` WHERE `apps`.`account_id` = 1 AND (apps.deleted_at IS NULL)
SELECT `apps`.* FROM `apps` WHERE `apps`.`account_id` = 1 AND (apps.deleted_at IS NULL) LIMIT 5 OFFSET 0

  def create
    @application = App.new(params[:app])
    respond_to do |format|
      if @application.save
---
INSERT INTO `apps` (`account_id`, `application_icon_content_type`, `application_icon_file_name`, `created_at`, `crypted_development_push_certificate_password`, `crypted_development_push_certificate_salt`, `crypted_production_push_certificate_password`, `crypted_production_push_certificate_salt`, `deleted_at`, `development_push_certificate_content_type`, `development_push_certificate_file_name`, `key`, `name`, `production_push_certificate_content_type`, `production_push_certificate_file_name`, `updated_at`) VALUES (1, 'image/png', 'Screenshot at 2012-03-28 21:46:43.png', '2012-05-11 17:33:50', 'tamil4g@123', NULL, 'tamil4g@123', NULL, NULL, 'application/x-pkcs12', '7a82315b4289b01bc326289e9203bbbb.p12', 'javia', 'mehul', 'application/x-pkcs12', 'tamil4g Production Push.p12', '2012-05-11 17:33:50')

  def show
    @application = App.find(params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1

  def edit
    @application = App.find(params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1

  def update
    @application = App.find(params[:id])
    respond_to do |format|
      if @application.update_attributes(params[:app])
---
SELECT `apps`.* FROM `apps` WHERE (apps.deleted_at IS NULL) AND (id not = 3 and key = 'javia' and deleted_at = NULL)
UPDATE `apps` SET `crypted_development_push_certificate_salt` = 'wQ7RxJVsHoQ=', `crypted_development_push_certificate_password` = '8d8b3a7723d705c4e0659959742849bd96231548e13300cfc9c8d6dd0b1fbcfe', `updated_at` = '2012-05-07 19:35:28' WHERE `apps`.`id` = 1

  def destroy
    @application = App.find(params[:id])
---
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 2 AND (apps.deleted_at IS NULL) LIMIT 1