app/controllers/notifications_controller.rb

SELECT COUNT(*) FROM `notifications` WHERE (notifications.deleted_at IS NULL) AND (app_id = '1')
SELECT `notifications`.* FROM `notifications` WHERE (notifications.deleted_at IS NULL) AND (app_id = '1') LIMIT 5 OFFSET 0
---
  def index
    @notifications = Notification.paginate(:conditions => ["app_id = ?", params[:id]],:per_page =>5, :page => params[:page] )

SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1
INSERT INTO `notifications` (`alert`, `app_id`, `badge`, `created_at`, `deleted_at`, `dispatched_count`, `payload`, `scheduled_count`, `sound`, `status`, `updated_at`) VALUES ('1', 1, 1, '2012-05-07 15:31:12', NULL, NULL, '{\"aps\":{\"badge\":1,\"alert\":\"1\",\"sound\":\"2\"}}', NULL, '2', 1, '2012-05-07 15:31:12')
---
  def create
    @notification = Notification.new(params[:notification])
    #fetch application data of this perticular notification
    @application = App.find(params['notification']['app_id'])
    respond_to do |format|
	  if @notification.save

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 1 AND (notifications.deleted_at IS NULL) LIMIT 1
SELECT `apps`.* FROM `apps` WHERE `apps`.`id` = 1 AND (apps.deleted_at IS NULL) LIMIT 1
---
  def show
    @notification = Notification.find(params[:id])
    @application = App.find(params[:app_id])

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 1 AND (notifications.deleted_at IS NULL) LIMIT 1
---
  def edit
    @notifications = Notification.find(params[:id])

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 3 AND (notifications.deleted_at IS NULL) LIMIT 1
---
  def destroy
    @notifications = Notification.find(params[:id])